IRP/src/DataProcessors/PointOfSale/PointOfSale.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
 <name>PointOfSale</name>
 <attributes>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>Discount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>Cashback</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>CustomerCash</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>Workstation</name>
  <type>
   <types>CatalogRef.Workstations</types>
  </type>
 </attributes>
 <attributes>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
</mdclass:DataProcessor>

IRP/src/InformationRegisters/HardwareLog/HardwareLog.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>HardwareLog</name>
 <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
 <resources>
  <name>Method</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>200</length>
   </stringQualifiers>
  </type>
 </resources>
 <resources>
  <name>Request</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>Data</name>
  <type>
   <types>String</types>
  </type>
 </resources>
 <resources>
  <name>Result</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <dimensions>
  <name>User</name>
  <type>
   <types>CatalogRef.Users</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Hardware</name>
  <type>
   <types>CatalogRef.Hardware</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Date</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>15</precision>
   </numberQualifiers>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/EquipmentTypes/EquipmentTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>EquipmentTypes</name>
 <enumValues>
  <name>InputDevice</name>
 </enumValues>
 <enumValues>
  <name>BarcodeScanner</name>
 </enumValues>
 <enumValues>
  <name>FiscalPrinter</name>
 </enumValues>
 <enumValues>
  <name>Acquiring</name>
 </enumValues>
</mdclass:Enum>

IRP/src/DataProcessors/PointOfSale/Forms/GetSettlement/Module.bsl
// @strict-types


&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Workstation = Parameters.Workstation;
	FiscalPrinterFind = HardwareServer.GetWorkstationHardwareByEquipmentType(Workstation, Enums.EquipmentTypes.FiscalPrinter);
	If FiscalPrinterFind.Count() = 1 Then
		FiscalPrinter = FiscalPrinterFind[0];
	EndIf;
	AcquiringList = HardwareServer.GetWorkstationHardwareByEquipmentType(Workstation, Enums.EquipmentTypes.Acquiring);
	
	For Each Acquiring In AcquiringList Do
		NewRow = HardwareList.Add();
		NewRow.Hardware = Acquiring;
	EndDo;
	
EndProcedure

&AtClient
Async Procedure PrintLastSettlement(Command)
	CurrentRow = Items.HardwareList.CurrentData;
	If CurrentRow = Undefined Then
		Return;
	EndIf;

	PaymentSettings = PrintLastSettlementAtServer(CurrentRow.Hardware);
	
	If PaymentSettings = Undefined Then
		Return;
	EndIf;
	
	CRS = New Structure;
	CRS.Insert("FiscalPrinter", FiscalPrinter);
	Str = New Structure("Payments", New Array);
	//@skip-check typed-value-adding-to-untyped-collection
	Str.Payments.Add(New Structure("PaymentInfo", PaymentSettings));
	Await EquipmentFiscalPrinterClient.PrintTextDocument(CRS, Str); 
EndProcedure

&AtServer
Function PrintLastSettlementAtServer(Hardware)
	Query = New Query;
	Query.Text =
		"SELECT TOP 1
		|	HardwareLogSliceLast.Data,
		|	HardwareLogSliceLast.Result
		|FROM
		|	InformationRegister.HardwareLog AS HardwareLogSliceLast
		|WHERE
		|	HardwareLogSliceLast.Hardware = &Hardware
		|	AND HardwareLogSliceLast.Method = &Method
		|	AND NOT HardwareLogSliceLast.Request
		|
		|ORDER BY
		|	HardwareLogSliceLast.Date DESC";
	
	Query.SetParameter("Hardware", Hardware);
	Query.SetParameter("Method", "Settlement");
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	If SelectionDetailRecords.Next() Then
		DataStr = CommonFunctionsServer.DeserializeJSON(SelectionDetailRecords.Data);
		If SelectionDetailRecords.Result Then
			Return DataStr;
		Else
			CommonFunctionsClientServer.ShowUsersMessage(R().EqAc_LastSettlementHasError + Chars.LF + DataStr.Info.Error);
		EndIf;
	Else
		CommonFunctionsClientServer.ShowUsersMessage(R().EqAc_LastSettlementNotFound);
	EndIf;
	Return Undefined;
EndFunction

&AtClient
Async Procedure GetSettlement(Command)
	
	CurrentRow = Items.HardwareList.CurrentData;
	If CurrentRow = Undefined Then
		Return;
	EndIf;
	
	SettlementSettings = EquipmentAcquiringAPIClient.SettlementSettings();
	ResultSettlement = Await EquipmentAcquiringAPIClient.Settlement(CurrentRow.Hardware, SettlementSettings);
	Str = New Structure("Payments", New Array);
	//@skip-check typed-value-adding-to-untyped-collection
	Str.Payments.Add(New Structure("PaymentInfo", SettlementSettings));
	CRS = New Structure;
	CRS.Insert("FiscalPrinter", FiscalPrinter);
	If ResultSettlement Then
		Await EquipmentFiscalPrinterClient.PrintTextDocument(CRS, Str);
	EndIf;
	
EndProcedure
